<template>
  <div class="container detail-area" style="margin-top: 8rem; margin-bottom: 1rem;">
    <div class="row">
      <div class="col-12">
        <h2 class="text-center">โปรแกรมวิเคราะห์องค์ประกอบร่างกายและดัชนีมวลกล้ามเนื้อสำหรับเด็กและผู้ใหญ่</h2>
        <br />
        <div class="paragraph">
          <p>
            กล้ามเนื้อลายคือเนื้อเยื่อหลักของร่างกาย ทำหน้าที่หลักหลากหลายประการ
            กล้ามเนื้อคลายหดและคลายตัวเพื่อเกิดการเคลื่อนไหว
            กล้ามเนื้อลายควบคุมการใช้พลังงานของร่างกายและควบคุมอุณหภูมิร่างกายให้คงที่
            กล้ามเนื้อลายจะเปลี่ยนพลังงานเคมีจากสารอาหารเป็นพลังงานกลในรูปของแรง
            แรงทำให้กระดูกและข้อเกิดการเคลื่อนไหว
            <br />
            <br />แรงที่กระทำต่อน้ำหนักตัวผ่านข้อต่อและกระดูกจะแสดงออกมาในรูปของสมรรถนะทางกาย ได้แก่
          </p>
          <ul>
            <li>ความแข็งแรง พละกำลัง</li>
            <li>ความคล่องแคล่วว่องไว</li>
            <li>ความอดทน</li>
            <li>ความสามารถในการเคลื่อนไหว</li>
          </ul>
          <p>
            กล้ามเนื้อลายความคุมระดับของพลังงานของร่างกาย โดยเก็บน้ำตาลเข้าสู่กล้ามเนื้อหลังมื้ออาหาร
            ควบคุมระดับน้ำตาลและสลายพลังงานจากเนื้อเยื่อไขมันเพื่อเป็นแหล่งพลังงานใช้ในการเคลื่อนไหว
            ควบคุมระดับน้ำตาลและสลายพลังงานจากเนื้อเยื่อไขมันเพื่อเป็นแหล่งพลังงานใช้ในการเคลื่อนไหวในระยะอดอาหาร
            หรือการใช้พลังงานต่อเนื่องเวลานาน
            ในสภาวะปกติกล้ามเนื้อลายจะสลายพลังงานตลอดเวลา
            เพื่อควบคุมอุณหภูมิของร่างกายให้คงที่ ปริมาณกล้ามเนื้อลายจึงสัมพันธ์กับการควบคุมน้ำหนักตัว
          </p>
          <p>
            องค์ประกอบของร่างกายและปัจจัยกำหนดสุขภาพของกลุ่มโรคไม่ติดต่อเรื้อรัง ปริมาณมวลกล้ามเนื้อที่มาก
            จะทำให้สุภาพทางกายและสมรรถนะทางกายที่ดี ปริมาณมวลกล้ามเนื้อที่น้อยจึงสัมพันธ์กับความเจ็บป่วยเรื้อรัง
          </p>
          <hr />
        </div>
        <div class="paragraph">
          <p>
            ภายใต้สภาวะแวดล้อมที่บ้านโรงเรียนและการดูแลของผู้ปกครองครูที่เหมาะสม
            เด็กที่ได้รับโภชนาการเพียงพอ ระดับของกิจกรรมทางกายระดับปานกลางถึงหนัก
            การพักผ่อนนอนหลับที่เพียงพอ จะทำให้เด็กมีการเจริญเติบโตของกล้ามเนื้อ ในสัดส่วนที่
            มากขึ้นตามน้ำหนักตัวและส่วนสูงเมื่ออายุมากขึ้น มวลกล้ามเนื้อจะมีค่ามากขี้นเมื่ออายุมากขึ้น
          </p>
          <p>
            ในเพศชายจะมีมวลกล้ามเนื้อมากกว่าเพศหญิง การเปลี่ยนแปลงจะเห็นชัดเมื่อเข้าสู่วัยรุ่น
            มวลกล้ามเนื้อจะสูงสุดในวัยผู้ใหญ่และคงที่ระหว่างอายุ 19-40 ปี การถอดถอยหรือการเสื่อมสลาย
            ของกล้ามเนื้อตามวัยจะเกิดขึ้นเมื่ออายุมากกว่า 40 ปี โดยมวลกล้ามเนื้อจะค่อยลดลง
            <br />
            <br />
การเสริมสร้างกล้ามเนื้อและการชะลอการเสื่อมถอยสามารถทำได้โดย
          </p>
          <ul>
            <li>การเพิ่มกิจกรรมทางกาย</li>
            <li>การเพิ่มกิจกรรรมทางกายระดับปานกลางถึงหนัก</li>
            <li>การออกกำลังกายแบบการเสริมแรงต้าน</li>
            <li>การควบคุมปริมาณของอาหารที่มีโปรตีนให้เพียงพอ</li>
          </ul>
          <p>
            การวัดมวลกล้ามเนื้อมีหลายวิธี วิธีที่ง่ายในปัจจุบันคือ การใช้เครื่องวิเคราะห์องค์ประกอบร่างกาย
            หรือเครื่องวิเคราะห์อิมพีแดนซ์ของไฟฟ้าชีวภาพซึ่งมีหลากหลายราคาหลายแบบ แบ่งตามลักษณะการใช้งาน
            ซึ่งบ่งถึงระดับความน่าเชื่อถือและความแม่นยำ การใช้งานบ้าน ศูนย์ออกกำลังกาย มหาวิทยาลัย คลินิกและโรงพยาบาล
            ข้อจำกัดของการใช้เครื่องวิเคราะห์องค์ประกอบร่างกายราคาถูกระดับการใช้งานบ้านคือ ความน่าเชื่อถือและความแม่นยำ
            ซึ่งปัญหาประกาสำคัญคือ การแปลผลการตรวจเพื่อค่ามวลกล้ามเนื้อที่วัด เนื่องจากไม่มีฐานข้อมูลค่ามาตรฐานในการแปลผลแต่ละช่วงอายุ เพศ
          </p>
          <p>
            โปรแกรมวิเคราะห์องค์ประกอบร่างกายและดัชนีมวลกล้ามเนื้อ ถูกสร้างเพื่อใช้สำหรับ
            การแปลผลและให้คำแนะนำเบื้องต้นต่อบุคคลทั่วไปเด็กและผู้ใหญ่อายุมากกว่า 5 ปี ที่ทราบค่า
            มวลกล้ามเนื้อของตนเองภายหลังจากการตรวจวัดมวลกล้ามเนื้อด้วยเครื่องวัดองค์ประกอบร่างกาย
            ที่มีราคาถูก เพื่อการปรับใช้งานในบ้าน โรงเรียน สำหรับประชากรขนาดใหญ่
            โปรแกรมจะคำนวณค่าดัชนีมวลกล้ามเนื้อ และแปลค่าดัชนีมวลกล้ามเนื้อร่วมกับค่าดัชนีมวลกาย
          </p>
          <hr />
        </div>
      </div>
    </div>

    <div class="row">
      <h4 class="pt-4">การเปลี่ยนแปลงขององค์ประกอบร่างกาย น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัว</h4>
      <br />
      <div class="col-lg-5 col-md-12 d-flex align-items-center">
        <img src="../assets/img/1.png" width="105%" />
      </div>
      <div class="col-lg-7 col-md-12 py-5">
        <ul>
          <li>น้ำหนักตัวของร่างกายประกอบขึ้นจาก มวลไขมันและมวลปราศจากไขมัน มวลกล้ามเนื้อเป็นองค์ประกอบส่วนใหญ่ของมวลปราศจากไขมัน และมวลอื่น ๆ เช่น กระดูก เอ็น เนื้อเยื่ออื่น</li>
          <li>น้ำหนักตัวและส่วนสูงจะมีการเปลี่ยนแปลงมากขึ้นจากเด็กไปผู้ใหญ่ เป็นผลจากการเจริญเติบโต</li>
          <li>
            องค์ประกอบของร่างกาย
            <dl>
              <dd>- น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวประมาณ 87 เปอร์เซ็นต์ (ค่าปกติ 62-93 เปอร์เซ็นต์) ในเด็กชายอายุ 5 ปี ลดลงเหลือประมาณ 77 เปอร์เซ็นต์ (ค่าปกติ 61-92 เปอร์เซ็นต์) ในผู้ชาย</dd>
              <dd>- น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวประมาณ 84 เปอร์เซ็นต์ (ค่าปกติ 69-91 เปอร์เซ็นต์) ในเด็กหญิงอายุ 5 ปี ลดลงเหลือประมาณ 67 เปอร์เซ็นต์ (ค่าปกติ 48-83 เปอร์เซ็นต์) ในผู้หญิง</dd>
              <dd>- เมื่ออายุเพิ่มขึ้น น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวจะลดลงเกิดจากมวลไขมันเพิ่มขึ้น</dd>
              <dd>- เพศชายมีมวลกล้ามเนื้อมากกว่าเพศหญิง</dd>
              <dd>- เพศหญิงมีมวลไขมันมากกว่าเพศชาย</dd>
            </dl>
          </li>
        </ul>
      </div>
    </div>

    <div class="row">
      <h4>การเปลี่ยนแปลงของดัชนีมวลกายและข้อจำกัดของดัชนีมวลกาย</h4>
      <br />
      <div class="col-lg-7 col-md-12 py-5">
        <ul>
          <li>
            ดัชนีมวลกายคือ ค่าน้ำหนักตัวปรับด้วยค่าความสูง หรือ น้ำหนักตัว/ความสูง
            <sup>2</sup> กิโลกรัม/เมตร
            <sup>2</sup>
          </li>
          <li>ดัชนีมวลกายถูกใช้ในผู้ใหญ่เพื่อบ่งถึงภาวะผอมและอ้วน เนื่องจากความสูงผู้ใหญ่มีค่าคงที่ การเปลี่ยนแปลงของดัชนีมวลกายจึงบ่งบอกถึงการเปลี่ยนแปลงของน้ำหนักตัวที่เพิ่มขึ้นหรือลดลง ซึ่งอาจเกิดจากการลดลงหรือเพิ่มขึ้นของมวลไขมัน และ มวลกล้ามเนื้อ</li>
          <li>การเพิ่มขึ้นหรือลดลงของดัชนีมวลกายเพื่อบ่งถึงภาวะผอมและอ้วนอาจเกิดความคลาดเคลื่อนจากความจริง</li>
          <li>การใช้ดัชนีมวลกายในเด็กมีข้อยุ่งยากและข้อจำกัด น้ำหนักตัวและส่วนสูงของเด็กจะมีการเปลี่ยนแปลงตลอดเวลาซึ่งเป็นผลจากการเจริญเติบโต โดยจะมีค่ามากขึ้นจากเด็กไปผู้ใหญ่ การเพิ่มขึ้นหรือลดลงอาจเป็นผลจากการเปลี่ยนแปลงของค่าน้ำหนักตัวหรือความสูง การแปลผลจึงต้องเปรียบเทียบกับค่าดัชนีมวลกายของเด็กที่มีอายุและเพศเดียวกัน</li>
          <li>ดัชนีมวลกายปกติในเด็กคือค่าระหว่าง 15th-85th เปอร์เซนไทล์ หรือในผู้ใหญ่ระหว่าง 18.5th-22.99th เปอร์เซนไทล์</li>
        </ul>
      </div>
      <div class="col-lg-5 col-md-12 d-flex align-items-center">
        <img src="../assets/img/2.png" width="105%" />
      </div>
    </div>

    <div class="row">
      <div class="col-lg-3 col-md-6 col-sm-12 text-center">
        <i>
          ดัชนีมวลกล้ามเนื้อ
          <br />ของเด็กชาย 5-18 ปี
        </i>
        <br />
        <img src="../assets/img/mmi_boy.png" width="100%" />
      </div>
      <div class="col-lg-3 col-md-6 col-sm-12 text-center">
        <i>
          ดัชนีมวลกล้ามเนื้อ
          <br />ของเด็กหญิง 5-18 ปี
        </i>
        <br />
        <img src="../assets/img/mmi_girl.png" width="100%" />
      </div>
      <div class="col-lg-3 col-md-6 col-sm-12 text-center">
        <i>
          ดัชนีมวลกล้ามเนื้อ
          <br />ของเพศชาย 19-40 ปี
        </i>
        <br />
        <img src="../assets/img/mmi_men.png" width="100%" />
      </div>
      <div class="col-lg-3 col-md-6 col-sm-12 text-center">
        <i>
          ดัชนีมวลกล้ามเนื้อ
          <br />ของเพศหญิง 19-40 ปี
        </i>
        <br />
        <img src="../assets/img/mmi_women.png" width="100%" />
      </div>
    </div>

    <div class="row">
      <div class="col-lg-5 col-md-12 d-flex align-items-center">
        <img src="../assets/img/3.png" width="105%" />
      </div>
      <div class="col-lg-7 col-md-12 py-5">
        <ul>
          <li>
            ดัชนีมวลกล้ามเนื้อคือ ค่าน้ำหนักมวลกล้ามเนื้อปรับด้วยค่าความสูง หรือ น้ำหนักกล้ามเนื้อ/ความสูง
            <sup>2</sup> กิโลกรัม/เมตร
            <sup>2</sup>
          </li>
          <li>เพศชายจะมีดัชนีมวลกล้ามเนื้อสูงมากกว่าในเพศหญิง จะเห็นชัดเจนเมื่อเข้าสู่ระยะวัยรุ่น</li>
          <li>เพศชายดัชนีมวลกล้ามเนื้อมีค่า 12th เปอร์เซนไทล์ (ค่าปกติ 11th-15th) ในเด็กชายอายุ 5 ปี และในผู้ใหญ่มีค่าประมาณ 18th เปอร์เซนไทล์ (ค่าปกติ 14th-23th)</li>
          <li>เพศหญิงดัชนีมวลกล้ามเนื้อมีค่า 12th เปอร์เซนไทล์ (ค่าปกติ 11th-14th) ในเด็กหญิงอายุ 5 ปี และในผู้ใหญ่มีค่าประมาณ 14th เปอร์เซนไทล์ (ค่าปกติ 12th-19th)</li>
          <li>ดัชนีมวลกล้ามเนื้อค่าปกติจะมีค่าระหว่าง 15th-85th เปอร์เซนไทล์</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "DetailPage"
};
</script>

<style scoped>

.detail-area p {
  font-weight: 300;
  font-size: 18px;
  padding: 0.5rem 0;
}

.detail-area ul  {
  font-weight: 300;
  font-size: 18px;
}

</style>